node {
  name: "Variable/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0010000000474974513
      }
    }
  }
}
node {
  name: "Variable"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "Variable/Assign"
  op: "Assign"
  input: "Variable"
  input: "Variable/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Variable"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "Variable/read"
  op: "Identity"
  input: "Variable"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Variable"
      }
    }
  }
}
node {
  name: "Variable_1/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "Variable_1"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "Variable_1/Assign"
  op: "Assign"
  input: "Variable_1"
  input: "Variable_1/initial_value"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Variable_1"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "Variable_1/read"
  op: "Identity"
  input: "Variable_1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Variable_1"
      }
    }
  }
}
node {
  name: "Variable_2/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "Variable_2"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "Variable_2/Assign"
  op: "Assign"
  input: "Variable_2"
  input: "Variable_2/initial_value"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Variable_2"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "Variable_2/read"
  op: "Identity"
  input: "Variable_2"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Variable_2"
      }
    }
  }
}
node {
  name: "add/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "add"
  op: "Add"
  input: "Variable_2/read"
  input: "add/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Assign"
  op: "Assign"
  input: "Variable_2"
  input: "add"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Variable_2"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: false
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "mul/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.10000000149011612
      }
    }
  }
}
node {
  name: "mul"
  op: "Mul"
  input: "Variable/read"
  input: "mul/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "mul_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.009999999776482582
      }
    }
  }
}
node {
  name: "mul_1"
  op: "Mul"
  input: "Variable/read"
  input: "mul_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "PiecewiseConstant/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 80
      }
    }
  }
}
node {
  name: "PiecewiseConstant/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 120
      }
    }
  }
}
node {
  name: "PiecewiseConstant/LessEqual"
  op: "LessEqual"
  input: "Variable_2/read"
  input: "PiecewiseConstant/Const"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "PiecewiseConstant/Greater"
  op: "Greater"
  input: "Variable_2/read"
  input: "PiecewiseConstant/Const_1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "PiecewiseConstant/Greater_1"
  op: "Greater"
  input: "Variable_2/read"
  input: "PiecewiseConstant/Const"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "PiecewiseConstant/LessEqual_1"
  op: "LessEqual"
  input: "Variable_2/read"
  input: "PiecewiseConstant/Const_1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "PiecewiseConstant/and"
  op: "LogicalAnd"
  input: "PiecewiseConstant/Greater_1"
  input: "PiecewiseConstant/LessEqual_1"
}
node {
  name: "PiecewiseConstant/case/preds_c"
  op: "Pack"
  input: "PiecewiseConstant/LessEqual"
  input: "PiecewiseConstant/Greater"
  input: "PiecewiseConstant/and"
  attr {
    key: "N"
    value {
      i: 3
    }
  }
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "PiecewiseConstant/case/Cast"
  op: "Cast"
  input: "PiecewiseConstant/case/preds_c"
  attr {
    key: "DstT"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "PiecewiseConstant/case/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "PiecewiseConstant/case/num_true_conds"
  op: "Sum"
  input: "PiecewiseConstant/case/Cast"
  input: "PiecewiseConstant/case/Const"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "PiecewiseConstant/case/n_true_conds"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "PiecewiseConstant/case/LessEqual"
  op: "LessEqual"
  input: "PiecewiseConstant/case/num_true_conds"
  input: "PiecewiseConstant/case/n_true_conds"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "PiecewiseConstant/case/Assert/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "Input error: exclusive=True: more than 1 conditions (PiecewiseConstant/LessEqual:0, PiecewiseConstant/Greater:0, PiecewiseConstant/and:0) evaluated as True:"
      }
    }
  }
}
node {
  name: "PiecewiseConstant/case/Assert/AssertGuard/Switch"
  op: "Switch"
  input: "PiecewiseConstant/case/LessEqual"
  input: "PiecewiseConstant/case/LessEqual"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "PiecewiseConstant/case/Assert/AssertGuard/switch_t"
  op: "Identity"
  input: "PiecewiseConstant/case/Assert/AssertGuard/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "PiecewiseConstant/case/Assert/AssertGuard/switch_f"
  op: "Identity"
  input: "PiecewiseConstant/case/Assert/AssertGuard/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "PiecewiseConstant/case/Assert/AssertGuard/pred_id"
  op: "Identity"
  input: "PiecewiseConstant/case/LessEqual"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "PiecewiseConstant/case/Assert/AssertGuard/NoOp"
  op: "NoOp"
  input: "^PiecewiseConstant/case/Assert/AssertGuard/switch_t"
}
node {
  name: "PiecewiseConstant/case/Assert/AssertGuard/control_dependency"
  op: "Identity"
  input: "PiecewiseConstant/case/Assert/AssertGuard/switch_t"
  input: "^PiecewiseConstant/case/Assert/AssertGuard/NoOp"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@PiecewiseConstant/case/Assert/AssertGuard/switch_t"
      }
    }
  }
}
node {
  name: "PiecewiseConstant/case/Assert/AssertGuard/Assert/data_0"
  op: "Const"
  input: "^PiecewiseConstant/case/Assert/AssertGuard/switch_f"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "Input error: exclusive=True: more than 1 conditions (PiecewiseConstant/LessEqual:0, PiecewiseConstant/Greater:0, PiecewiseConstant/and:0) evaluated as True:"
      }
    }
  }
}
node {
  name: "PiecewiseConstant/case/Assert/AssertGuard/Assert"
  op: "Assert"
  input: "PiecewiseConstant/case/Assert/AssertGuard/Assert/Switch"
  input: "PiecewiseConstant/case/Assert/AssertGuard/Assert/data_0"
  input: "PiecewiseConstant/case/Assert/AssertGuard/Assert/Switch_1"
  attr {
    key: "T"
    value {
      list {
        type: DT_STRING
        type: DT_BOOL
      }
    }
  }
  attr {
    key: "summarize"
    value {
      i: 3
    }
  }
}
node {
  name: "PiecewiseConstant/case/Assert/AssertGuard/Assert/Switch"
  op: "Switch"
  input: "PiecewiseConstant/case/LessEqual"
  input: "PiecewiseConstant/case/Assert/AssertGuard/pred_id"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@PiecewiseConstant/case/LessEqual"
      }
    }
  }
}
node {
  name: "PiecewiseConstant/case/Assert/AssertGuard/Assert/Switch_1"
  op: "Switch"
  input: "PiecewiseConstant/case/preds_c"
  input: "PiecewiseConstant/case/Assert/AssertGuard/pred_id"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@PiecewiseConstant/case/preds_c"
      }
    }
  }
}
node {
  name: "PiecewiseConstant/case/Assert/AssertGuard/control_dependency_1"
  op: "Identity"
  input: "PiecewiseConstant/case/Assert/AssertGuard/switch_f"
  input: "^PiecewiseConstant/case/Assert/AssertGuard/Assert"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@PiecewiseConstant/case/Assert/AssertGuard/switch_f"
      }
    }
  }
}
node {
  name: "PiecewiseConstant/case/Assert/AssertGuard/Merge"
  op: "Merge"
  input: "PiecewiseConstant/case/Assert/AssertGuard/control_dependency_1"
  input: "PiecewiseConstant/case/Assert/AssertGuard/control_dependency"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "PiecewiseConstant/case/cond/Switch"
  op: "Switch"
  input: "PiecewiseConstant/LessEqual"
  input: "PiecewiseConstant/LessEqual"
  input: "^PiecewiseConstant/case/Assert/AssertGuard/Merge"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "PiecewiseConstant/case/cond/switch_t"
  op: "Identity"
  input: "PiecewiseConstant/case/cond/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "PiecewiseConstant/case/cond/switch_f"
  op: "Identity"
  input: "PiecewiseConstant/case/cond/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "PiecewiseConstant/case/cond/pred_id"
  op: "Identity"
  input: "PiecewiseConstant/LessEqual"
  input: "^PiecewiseConstant/case/Assert/AssertGuard/Merge"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "PiecewiseConstant/case/cond/Switch_1"
  op: "Switch"
  input: "Variable/read"
  input: "PiecewiseConstant/case/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Variable"
      }
    }
  }
}
node {
  name: "PiecewiseConstant/case/cond/cond/Switch"
  op: "Switch"
  input: "PiecewiseConstant/case/cond/cond/Switch/Switch"
  input: "PiecewiseConstant/case/cond/cond/Switch/Switch"
  input: "^PiecewiseConstant/case/Assert/AssertGuard/Merge"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "PiecewiseConstant/case/cond/cond/Switch/Switch"
  op: "Switch"
  input: "PiecewiseConstant/Greater"
  input: "PiecewiseConstant/case/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@PiecewiseConstant/Greater"
      }
    }
  }
}
node {
  name: "PiecewiseConstant/case/cond/cond/switch_t"
  op: "Identity"
  input: "PiecewiseConstant/case/cond/cond/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "PiecewiseConstant/case/cond/cond/switch_f"
  op: "Identity"
  input: "PiecewiseConstant/case/cond/cond/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "PiecewiseConstant/case/cond/cond/pred_id"
  op: "Identity"
  input: "PiecewiseConstant/case/cond/cond/Switch/Switch"
  input: "^PiecewiseConstant/case/Assert/AssertGuard/Merge"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "PiecewiseConstant/case/cond/cond/Switch_1"
  op: "Switch"
  input: "mul_1"
  input: "PiecewiseConstant/case/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mul_1"
      }
    }
  }
}
node {
  name: "PiecewiseConstant/case/cond/cond/Switch_2"
  op: "Switch"
  input: "PiecewiseConstant/case/cond/cond/Switch_1"
  input: "PiecewiseConstant/case/cond/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mul_1"
      }
    }
  }
}
node {
  name: "PiecewiseConstant/case/cond/cond/cond/Switch"
  op: "Switch"
  input: "PiecewiseConstant/case/cond/cond/cond/Switch/Switch_1"
  input: "PiecewiseConstant/case/cond/cond/cond/Switch/Switch_1"
  input: "^PiecewiseConstant/case/Assert/AssertGuard/Merge"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "PiecewiseConstant/case/cond/cond/cond/Switch/Switch"
  op: "Switch"
  input: "PiecewiseConstant/and"
  input: "PiecewiseConstant/case/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@PiecewiseConstant/and"
      }
    }
  }
}
node {
  name: "PiecewiseConstant/case/cond/cond/cond/Switch/Switch_1"
  op: "Switch"
  input: "PiecewiseConstant/case/cond/cond/cond/Switch/Switch"
  input: "PiecewiseConstant/case/cond/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@PiecewiseConstant/and"
      }
    }
  }
}
node {
  name: "PiecewiseConstant/case/cond/cond/cond/switch_t"
  op: "Identity"
  input: "PiecewiseConstant/case/cond/cond/cond/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "PiecewiseConstant/case/cond/cond/cond/switch_f"
  op: "Identity"
  input: "PiecewiseConstant/case/cond/cond/cond/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "PiecewiseConstant/case/cond/cond/cond/pred_id"
  op: "Identity"
  input: "PiecewiseConstant/case/cond/cond/cond/Switch/Switch_1"
  input: "^PiecewiseConstant/case/Assert/AssertGuard/Merge"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "PiecewiseConstant/case/cond/cond/cond/Switch_1"
  op: "Switch"
  input: "mul"
  input: "PiecewiseConstant/case/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mul"
      }
    }
  }
}
node {
  name: "PiecewiseConstant/case/cond/cond/cond/Switch_2"
  op: "Switch"
  input: "PiecewiseConstant/case/cond/cond/cond/Switch_1"
  input: "PiecewiseConstant/case/cond/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mul"
      }
    }
  }
}
node {
  name: "PiecewiseConstant/case/cond/cond/cond/Switch_3"
  op: "Switch"
  input: "PiecewiseConstant/case/cond/cond/cond/Switch_2"
  input: "PiecewiseConstant/case/cond/cond/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mul"
      }
    }
  }
}
node {
  name: "PiecewiseConstant/case/cond/cond/cond/Switch_4"
  op: "Switch"
  input: "Variable/read"
  input: "PiecewiseConstant/case/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Variable"
      }
    }
  }
}
node {
  name: "PiecewiseConstant/case/cond/cond/cond/Switch_5"
  op: "Switch"
  input: "PiecewiseConstant/case/cond/cond/cond/Switch_4"
  input: "PiecewiseConstant/case/cond/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Variable"
      }
    }
  }
}
node {
  name: "PiecewiseConstant/case/cond/cond/cond/Switch_6"
  op: "Switch"
  input: "PiecewiseConstant/case/cond/cond/cond/Switch_5"
  input: "PiecewiseConstant/case/cond/cond/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Variable"
      }
    }
  }
}
node {
  name: "PiecewiseConstant/case/cond/cond/cond/Merge"
  op: "Merge"
  input: "PiecewiseConstant/case/cond/cond/cond/Switch_6"
  input: "PiecewiseConstant/case/cond/cond/cond/Switch_3:1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "PiecewiseConstant/case/cond/cond/Merge"
  op: "Merge"
  input: "PiecewiseConstant/case/cond/cond/cond/Merge"
  input: "PiecewiseConstant/case/cond/cond/Switch_2:1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "PiecewiseConstant/case/cond/Merge"
  op: "Merge"
  input: "PiecewiseConstant/case/cond/cond/Merge"
  input: "PiecewiseConstant/case/cond/Switch_1:1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gpu_0/feature"
  op: "Placeholder"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 20
        }
        dim {
          size: 7
        }
      }
    }
  }
}
node {
  name: "gpu_0/number"
  op: "Placeholder"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
      }
    }
  }
}
node {
  name: "gpu_0/coordinate"
  op: "Placeholder"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 4
        }
      }
    }
  }
}
node {
  name: "gpu_0/Max/reduction_indices"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 2
      }
    }
  }
}
node {
  name: "gpu_0/Max"
  op: "Max"
  input: "gpu_0/feature"
  input: "gpu_0/Max/reduction_indices"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: true
    }
  }
}
node {
  name: "gpu_0/NotEqual/y"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "gpu_0/NotEqual"
  op: "NotEqual"
  input: "gpu_0/Max"
  input: "gpu_0/NotEqual/y"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "VFE-1/kernel/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@VFE-1/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\007\000\000\000\020\000\000\000"
      }
    }
  }
}
node {
  name: "VFE-1/kernel/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@VFE-1/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.5107539296150208
      }
    }
  }
}
node {
  name: "VFE-1/kernel/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@VFE-1/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5107539296150208
      }
    }
  }
}
node {
  name: "VFE-1/kernel/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "VFE-1/kernel/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@VFE-1/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "VFE-1/kernel/Initializer/random_uniform/sub"
  op: "Sub"
  input: "VFE-1/kernel/Initializer/random_uniform/max"
  input: "VFE-1/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@VFE-1/kernel"
      }
    }
  }
}
node {
  name: "VFE-1/kernel/Initializer/random_uniform/mul"
  op: "Mul"
  input: "VFE-1/kernel/Initializer/random_uniform/RandomUniform"
  input: "VFE-1/kernel/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@VFE-1/kernel"
      }
    }
  }
}
node {
  name: "VFE-1/kernel/Initializer/random_uniform"
  op: "Add"
  input: "VFE-1/kernel/Initializer/random_uniform/mul"
  input: "VFE-1/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@VFE-1/kernel"
      }
    }
  }
}
node {
  name: "VFE-1/kernel"
  op: "VariableV2"
  device: "/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@VFE-1/kernel"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 7
        }
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "VFE-1/kernel/Assign"
  op: "Assign"
  input: "VFE-1/kernel"
  input: "VFE-1/kernel/Initializer/random_uniform"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@VFE-1/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "VFE-1/kernel/read"
  op: "Identity"
  input: "VFE-1/kernel"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@VFE-1/kernel"
      }
    }
  }
}
node {
  name: "VFE-1/bias/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@VFE-1/bias"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "VFE-1/bias"
  op: "VariableV2"
  device: "/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@VFE-1/bias"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "VFE-1/bias/Assign"
  op: "Assign"
  input: "VFE-1/bias"
  input: "VFE-1/bias/Initializer/zeros"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@VFE-1/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "VFE-1/bias/read"
  op: "Identity"
  input: "VFE-1/bias"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@VFE-1/bias"
      }
    }
  }
}
node {
  name: "gpu_0/VFE-1/Tensordot/Shape"
  op: "Shape"
  input: "gpu_0/feature"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gpu_0/VFE-1/Tensordot/Rank"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 3
      }
    }
  }
}
node {
  name: "gpu_0/VFE-1/Tensordot/axes"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 2
      }
    }
  }
}
node {
  name: "gpu_0/VFE-1/Tensordot/GreaterEqual/y"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "gpu_0/VFE-1/Tensordot/GreaterEqual"
  op: "GreaterEqual"
  input: "gpu_0/VFE-1/Tensordot/axes"
  input: "gpu_0/VFE-1/Tensordot/GreaterEqual/y"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gpu_0/VFE-1/Tensordot/Cast"
  op: "Cast"
  input: "gpu_0/VFE-1/Tensordot/GreaterEqual"
  device: "/device:GPU:0"
  attr {
    key: "DstT"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "gpu_0/VFE-1/Tensordot/mul"
  op: "Mul"
  input: "gpu_0/VFE-1/Tensordot/Cast"
  input: "gpu_0/VFE-1/Tensordot/axes"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gpu_0/VFE-1/Tensordot/Less/y"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "gpu_0/VFE-1/Tensordot/Less"
  op: "Less"
  input: "gpu_0/VFE-1/Tensordot/axes"
  input: "gpu_0/VFE-1/Tensordot/Less/y"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gpu_0/VFE-1/Tensordot/Cast_1"
  op: "Cast"
  input: "gpu_0/VFE-1/Tensordot/Less"
  device: "/device:GPU:0"
  attr {
    key: "DstT"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "gpu_0/VFE-1/Tensordot/add"
  op: "Add"
  input: "gpu_0/VFE-1/Tensordot/axes"
  input: "gpu_0/VFE-1/Tensordot/Rank"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gpu_0/VFE-1/Tensordot/mul_1"
  op: "Mul"
  input: "gpu_0/VFE-1/Tensordot/Cast_1"
  input: "gpu_0/VFE-1/Tensordot/add"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gpu_0/VFE-1/Tensordot/add_1"
  op: "Add"
  input: "gpu_0/VFE-1/Tensordot/mul"
  input: "gpu_0/VFE-1/Tensordot/mul_1"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gpu_0/VFE-1/Tensordot/range/start"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "gpu_0/VFE-1/Tensordot/range/delta"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "gpu_0/VFE-1/Tensordot/range"
  op: "Range"
  input: "gpu_0/VFE-1/Tensordot/range/start"
  input: "gpu_0/VFE-1/Tensordot/Rank"
  input: "gpu_0/VFE-1/Tensordot/range/delta"
  device: "/device:GPU:0"
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gpu_0/VFE-1/Tensordot/ListDiff"
  op: "ListDiff"
  input: "gpu_0/VFE-1/Tensordot/range"
  input: "gpu_0/VFE-1/Tensordot/add_1"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "out_idx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gpu_0/VFE-1/Tensordot/Gather"
  op: "Gather"
  input: "gpu_0/VFE-1/Tensordot/Shape"
  input: "gpu_0/VFE-1/Tensordot/ListDiff"
  device: "/device:GPU:0"
  attr {
    key: "Tindices"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tparams"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "validate_indices"
    value {
      b: true
    }
  }
}
node {
  name: "gpu_0/VFE-1/Tensordot/Gather_1"
  op: "Gather"
  input: "gpu_0/VFE-1/Tensordot/Shape"
  input: "gpu_0/VFE-1/Tensordot/add_1"
  device: "/device:GPU:0"
  attr {
    key: "Tindices"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tparams"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "validate_indices"
    value {
      b: true
    }
  }
}
node {
  name: "gpu_0/VFE-1/Tensordot/Const"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "gpu_0/VFE-1/Tensordot/Prod"
  op: "Prod"
  input: "gpu_0/VFE-1/Tensordot/Gather"
  input: "gpu_0/VFE-1/Tensordot/Const"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "gpu_0/VFE-1/Tensordot/Const_1"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "gpu_0/VFE-1/Tensordot/Prod_1"
  op: "Prod"
  input: "gpu_0/VFE-1/Tensordot/Gather_1"
  input: "gpu_0/VFE-1/Tensordot/Const_1"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "gpu_0/VFE-1/Tensordot/concat/axis"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "gpu_0/VFE-1/Tensordot/concat"
  op: "ConcatV2"
  input: "gpu_0/VFE-1/Tensordot/Gather_1"
  input: "gpu_0/VFE-1/Tensordot/Gather"
  input: "gpu_0/VFE-1/Tensordot/concat/axis"
  device: "/device:GPU:0"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gpu_0/VFE-1/Tensordot/concat_1/axis"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "gpu_0/VFE-1/Tensordot/concat_1"
  op: "ConcatV2"
  input: "gpu_0/VFE-1/Tensordot/ListDiff"
  input: "gpu_0/VFE-1/Tensordot/add_1"
  input: "gpu_0/VFE-1/Tensordot/concat_1/axis"
  device: "/device:GPU:0"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gpu_0/VFE-1/Tensordot/stack"
  op: "Pack"
  input: "gpu_0/VFE-1/Tensordot/Prod"
  input: "gpu_0/VFE-1/Tensordot/Prod_1"
  device: "/device:GPU:0"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "gpu_0/VFE-1/Tensordot/transpose"
  op: "Transpose"
  input: "gpu_0/feature"
  input: "gpu_0/VFE-1/Tensordot/concat_1"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gpu_0/VFE-1/Tensordot/Reshape"
  op: "Reshape"
  input: "gpu_0/VFE-1/Tensordot/transpose"
  input: "gpu_0/VFE-1/Tensordot/stack"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gpu_0/VFE-1/Tensordot/transpose_1/perm"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "gpu_0/VFE-1/Tensordot/transpose_1"
  op: "Transpose"
  input: "VFE-1/kernel/read"
  input: "gpu_0/VFE-1/Tensordot/transpose_1/perm"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gpu_0/VFE-1/Tensordot/Reshape_1/shape"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\007\000\000\000\020\000\000\000"
      }
    }
  }
}
node {
  name: "gpu_0/VFE-1/Tensordot/Reshape_1"
  op: "Reshape"
  input: "gpu_0/VFE-1/Tensordot/transpose_1"
  input: "gpu_0/VFE-1/Tensordot/Reshape_1/shape"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gpu_0/VFE-1/Tensordot/MatMul"
  op: "MatMul"
  input: "gpu_0/VFE-1/Tensordot/Reshape"
  input: "gpu_0/VFE-1/Tensordot/Reshape_1"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "gpu_0/VFE-1/Tensordot/Const_2"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 16
      }
    }
  }
}
node {
  name: "gpu_0/VFE-1/Tensordot/concat_2/axis"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "gpu_0/VFE-1/Tensordot/concat_2"
  op: "ConcatV2"
  input: "gpu_0/VFE-1/Tensordot/Gather"
  input: "gpu_0/VFE-1/Tensordot/Const_2"
  input: "gpu_0/VFE-1/Tensordot/concat_2/axis"
  device: "/device:GPU:0"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gpu_0/VFE-1/Tensordot"
  op: "Reshape"
  input: "gpu_0/VFE-1/Tensordot/MatMul"
  input: "gpu_0/VFE-1/Tensordot/concat_2"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gpu_0/VFE-1/BiasAdd"
  op: "BiasAdd"
  input: "gpu_0/VFE-1/Tensordot"
  input: "VFE-1/bias/read"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "gpu_0/VFE-1/Relu"
  op: "Relu"
  input: "gpu_0/VFE-1/BiasAdd"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "VFE-1/gamma/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@VFE-1/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "VFE-1/gamma"
  op: "VariableV2"
  device: "/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@VFE-1/gamma"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "VFE-1/gamma/Assign"
  op: "Assign"
  input: "VFE-1/gamma"
  input: "VFE-1/gamma/Initializer/ones"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@VFE-1/gamma"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "VFE-1/gamma/read"
  op: "Identity"
  input: "VFE-1/gamma"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@VFE-1/gamma"
      }
    }
  }
}
node {
  name: "VFE-1/beta/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@VFE-1/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "VFE-1/beta"
  op: "VariableV2"
  device: "/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@VFE-1/beta"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "VFE-1/beta/Assign"
  op: "Assign"
  input: "VFE-1/beta"
  input: "VFE-1/beta/Initializer/zeros"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@VFE-1/beta"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "VFE-1/beta/read"
  op: "Identity"
  input: "VFE-1/beta"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@VFE-1/beta"
      }
    }
  }
}
node {
  name: "VFE-1/moving_mean/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@VFE-1/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "VFE-1/moving_mean"
  op: "VariableV2"
  device: "/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@VFE-1/moving_mean"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "VFE-1/moving_mean/Assign"
  op: "Assign"
  input: "VFE-1/moving_mean"
  input: "VFE-1/moving_mean/Initializer/zeros"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@VFE-1/moving_mean"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "VFE-1/moving_mean/read"
  op: "Identity"
  input: "VFE-1/moving_mean"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@VFE-1/moving_mean"
      }
    }
  }
}
node {
  name: "VFE-1/moving_variance/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@VFE-1/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "VFE-1/moving_variance"
  op: "VariableV2"
  device: "/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@VFE-1/moving_variance"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "VFE-1/moving_variance/Assign"
  op: "Assign"
  input: "VFE-1/moving_variance"
  input: "VFE-1/moving_variance/Initializer/ones"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@VFE-1/moving_variance"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "VFE-1/moving_variance/read"
  op: "Identity"
  input: "VFE-1/moving_variance"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@VFE-1/moving_variance"
      }
    }
  }
}
node {
  name: "gpu_0/VFE-1/moments/mean/reduction_indices"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "gpu_0/VFE-1/moments/mean"
  op: "Mean"
  input: "gpu_0/VFE-1/Relu"
  input: "gpu_0/VFE-1/moments/mean/reduction_indices"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: true
    }
  }
}
node {
  name: "gpu_0/VFE-1/moments/StopGradient"
  op: "StopGradient"
  input: "gpu_0/VFE-1/moments/mean"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gpu_0/VFE-1/moments/SquaredDifference"
  op: "SquaredDifference"
  input: "gpu_0/VFE-1/Relu"
  input: "gpu_0/VFE-1/moments/StopGradient"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gpu_0/VFE-1/moments/variance/reduction_indices"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "gpu_0/VFE-1/moments/variance"
  op: "Mean"
  input: "gpu_0/VFE-1/moments/SquaredDifference"
  input: "gpu_0/VFE-1/moments/variance/reduction_indices"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
